; domain
(define (domain hamiltonian-cycle)
  (:requirements :strips :typing :equality :negative-preconditions)
  (:types vertex count)
  (:predicates
    (connected ?v1 ?v2 - vertex)       ; there is an edge between v1 and v2
    (visited ?v - vertex)              ; vertex v has been visited
    (current ?v - vertex)              ; current position in the path
    (start ?v - vertex)                ; starting vertex
    (start-selected)                   ; indicates if start vertex has been selected
    (path-length ?n - count)           ; number of vertices visited so far
    (next ?n1 ?n2 - count)             ; successor relation for counts
    (total-vertices ?n - count)        ; total number of vertices in the graph
    (back-at-start)                    ; true when we're back at start vertex
  )
  
  (:action select-start
    :parameters (?v - vertex ?zero ?one - count)
    :precondition (and 
      (not (start-selected))           ; no start vertex selected yet
      (path-length ?zero)              ; path length is zero
      (next ?zero ?one)                ; one is the successor of zero
    )
    :effect (and
      (start ?v)                       ; mark as start vertex
      (start-selected)                 ; mark that a start vertex has been selected
      (current ?v)                     ; set as current position
      (visited ?v)                     ; mark as visited
      (not (path-length ?zero))        ; update path length
      (path-length ?one)               ; path length is now one
    )
  )
  
  (:action move-to-next
    :parameters (?from ?to - vertex ?n1 ?n2 - count)
    :precondition (and
      (current ?from)                 ; we are at vertex "from"
      (connected ?from ?to)           ; there is an edge from "from" to "to"
      (not (visited ?to))             ; "to" hasn't been visited yet
      (path-length ?n1)               ; current path length
      (next ?n1 ?n2)                  ; n2 is successor of n1
    )
    :effect (and
      (not (current ?from))           ; no longer at "from"
      (current ?to)                   ; now at "to"
      (visited ?to)                   ; mark "to" as visited
      (not (path-length ?n1))         ; update path length
      (path-length ?n2)               ; increment path length
    )
  )
  
  (:action complete-cycle
    :parameters (?last ?first - vertex ?n - count)
    :precondition (and
      (current ?last)                 ; we are at vertex "last"
      (start ?first)                  ; "first" is the start vertex
      (connected ?last ?first)        ; there is an edge from "last" to "first"
      (path-length ?n)                ; current path length
      (total-vertices ?n)             ; all vertices have been visited
    )
    :effect (and
      (not (current ?last))           ; no longer at "last"
      (current ?first)                ; back at "first"
      (back-at-start)                 ; mark that we're back at start
    )
  )
)

; problem
(define (problem hamiltonian-example)
  (:domain hamiltonian-cycle)
  
  (:objects
    v1 v2 v3 v4 v5 v6 v7 v8 v9 v10 v11 v12 v13 v14 v15 v16 v17 v18 v19 v20 v21 v22 v23 v24 v25 v26 v27 v28 v29 v30 - vertex
    n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 n13 n14 n15 n16 n17 n18 n19 n20 n21 n22 n23 n24 n25 n26 n27 n28 n29 n30 - count
  )
  
  (:init
    ; Define the graph structure (edges)
        (connected v1 v10)
    (connected v10 v1)
    (connected v1 v14)
    (connected v14 v1)
    (connected v1 v18)
    (connected v18 v1)
    (connected v1 v19)
    (connected v19 v1)
    (connected v1 v23)
    (connected v23 v1)
    (connected v1 v30)
    (connected v30 v1)
    (connected v2 v3)
    (connected v3 v2)
    (connected v2 v4)
    (connected v4 v2)
    (connected v2 v5)
    (connected v5 v2)
    (connected v2 v8)
    (connected v8 v2)
    (connected v2 v12)
    (connected v12 v2)
    (connected v2 v16)
    (connected v16 v2)
    (connected v2 v18)
    (connected v18 v2)
    (connected v2 v19)
    (connected v19 v2)
    (connected v2 v21)
    (connected v21 v2)
    (connected v2 v22)
    (connected v22 v2)
    (connected v2 v28)
    (connected v28 v2)
    (connected v2 v30)
    (connected v30 v2)
    (connected v3 v6)
    (connected v6 v3)
    (connected v3 v8)
    (connected v8 v3)
    (connected v3 v12)
    (connected v12 v3)
    (connected v3 v13)
    (connected v13 v3)
    (connected v3 v14)
    (connected v14 v3)
    (connected v3 v16)
    (connected v16 v3)
    (connected v3 v18)
    (connected v18 v3)
    (connected v3 v19)
    (connected v19 v3)
    (connected v3 v23)
    (connected v23 v3)
    (connected v3 v28)
    (connected v28 v3)
    (connected v4 v5)
    (connected v5 v4)
    (connected v4 v6)
    (connected v6 v4)
    (connected v4 v8)
    (connected v8 v4)
    (connected v4 v14)
    (connected v14 v4)
    (connected v4 v16)
    (connected v16 v4)
    (connected v4 v20)
    (connected v20 v4)
    (connected v4 v23)
    (connected v23 v4)
    (connected v4 v24)
    (connected v24 v4)
    (connected v4 v26)
    (connected v26 v4)
    (connected v4 v28)
    (connected v28 v4)
    (connected v5 v7)
    (connected v7 v5)
    (connected v5 v12)
    (connected v12 v5)
    (connected v5 v14)
    (connected v14 v5)
    (connected v5 v17)
    (connected v17 v5)
    (connected v5 v20)
    (connected v20 v5)
    (connected v5 v21)
    (connected v21 v5)
    (connected v5 v22)
    (connected v22 v5)
    (connected v5 v23)
    (connected v23 v5)
    (connected v5 v24)
    (connected v24 v5)
    (connected v5 v29)
    (connected v29 v5)
    (connected v6 v7)
    (connected v7 v6)
    (connected v6 v10)
    (connected v10 v6)
    (connected v6 v13)
    (connected v13 v6)
    (connected v6 v14)
    (connected v14 v6)
    (connected v6 v18)
    (connected v18 v6)
    (connected v6 v21)
    (connected v21 v6)
    (connected v6 v26)
    (connected v26 v6)
    (connected v6 v27)
    (connected v27 v6)
    (connected v6 v30)
    (connected v30 v6)
    (connected v7 v8)
    (connected v8 v7)
    (connected v7 v11)
    (connected v11 v7)
    (connected v7 v14)
    (connected v14 v7)
    (connected v7 v16)
    (connected v16 v7)
    (connected v7 v17)
    (connected v17 v7)
    (connected v7 v19)
    (connected v19 v7)
    (connected v7 v20)
    (connected v20 v7)
    (connected v7 v22)
    (connected v22 v7)
    (connected v7 v24)
    (connected v24 v7)
    (connected v7 v26)
    (connected v26 v7)
    (connected v7 v30)
    (connected v30 v7)
    (connected v8 v12)
    (connected v12 v8)
    (connected v8 v13)
    (connected v13 v8)
    (connected v8 v14)
    (connected v14 v8)
    (connected v8 v15)
    (connected v15 v8)
    (connected v8 v18)
    (connected v18 v8)
    (connected v8 v21)
    (connected v21 v8)
    (connected v8 v22)
    (connected v22 v8)
    (connected v8 v23)
    (connected v23 v8)
    (connected v8 v24)
    (connected v24 v8)
    (connected v9 v10)
    (connected v10 v9)
    (connected v9 v18)
    (connected v18 v9)
    (connected v9 v19)
    (connected v19 v9)
    (connected v9 v20)
    (connected v20 v9)
    (connected v9 v22)
    (connected v22 v9)
    (connected v9 v27)
    (connected v27 v9)
    (connected v9 v29)
    (connected v29 v9)
    (connected v10 v11)
    (connected v11 v10)
    (connected v10 v12)
    (connected v12 v10)
    (connected v10 v13)
    (connected v13 v10)
    (connected v10 v16)
    (connected v16 v10)
    (connected v10 v17)
    (connected v17 v10)
    (connected v10 v21)
    (connected v21 v10)
    (connected v10 v25)
    (connected v25 v10)
    (connected v10 v29)
    (connected v29 v10)
    (connected v10 v30)
    (connected v30 v10)
    (connected v11 v12)
    (connected v12 v11)
    (connected v11 v14)
    (connected v14 v11)
    (connected v11 v17)
    (connected v17 v11)
    (connected v11 v20)
    (connected v20 v11)
    (connected v11 v22)
    (connected v22 v11)
    (connected v11 v23)
    (connected v23 v11)
    (connected v11 v24)
    (connected v24 v11)
    (connected v11 v25)
    (connected v25 v11)
    (connected v11 v26)
    (connected v26 v11)
    (connected v11 v27)
    (connected v27 v11)
    (connected v12 v13)
    (connected v13 v12)
    (connected v12 v15)
    (connected v15 v12)
    (connected v12 v19)
    (connected v19 v12)
    (connected v12 v21)
    (connected v21 v12)
    (connected v12 v22)
    (connected v22 v12)
    (connected v13 v16)
    (connected v16 v13)
    (connected v13 v19)
    (connected v19 v13)
    (connected v13 v26)
    (connected v26 v13)
    (connected v13 v30)
    (connected v30 v13)
    (connected v14 v15)
    (connected v15 v14)
    (connected v14 v16)
    (connected v16 v14)
    (connected v14 v17)
    (connected v17 v14)
    (connected v14 v18)
    (connected v18 v14)
    (connected v14 v19)
    (connected v19 v14)
    (connected v14 v20)
    (connected v20 v14)
    (connected v14 v21)
    (connected v21 v14)
    (connected v14 v22)
    (connected v22 v14)
    (connected v14 v23)
    (connected v23 v14)
    (connected v14 v25)
    (connected v25 v14)
    (connected v14 v29)
    (connected v29 v14)
    (connected v15 v16)
    (connected v16 v15)
    (connected v15 v18)
    (connected v18 v15)
    (connected v15 v19)
    (connected v19 v15)
    (connected v15 v22)
    (connected v22 v15)
    (connected v15 v23)
    (connected v23 v15)
    (connected v15 v25)
    (connected v25 v15)
    (connected v15 v26)
    (connected v26 v15)
    (connected v15 v27)
    (connected v27 v15)
    (connected v15 v28)
    (connected v28 v15)
    (connected v15 v29)
    (connected v29 v15)
    (connected v15 v30)
    (connected v30 v15)
    (connected v16 v18)
    (connected v18 v16)
    (connected v16 v20)
    (connected v20 v16)
    (connected v16 v22)
    (connected v22 v16)
    (connected v16 v29)
    (connected v29 v16)
    (connected v16 v30)
    (connected v30 v16)
    (connected v17 v30)
    (connected v30 v17)
    (connected v18 v22)
    (connected v22 v18)
    (connected v18 v23)
    (connected v23 v18)
    (connected v18 v26)
    (connected v26 v18)
    (connected v18 v28)
    (connected v28 v18)
    (connected v18 v30)
    (connected v30 v18)
    (connected v19 v20)
    (connected v20 v19)
    (connected v19 v21)
    (connected v21 v19)
    (connected v19 v24)
    (connected v24 v19)
    (connected v19 v25)
    (connected v25 v19)
    (connected v19 v28)
    (connected v28 v19)
    (connected v19 v30)
    (connected v30 v19)
    (connected v20 v21)
    (connected v21 v20)
    (connected v20 v23)
    (connected v23 v20)
    (connected v20 v24)
    (connected v24 v20)
    (connected v20 v25)
    (connected v25 v20)
    (connected v21 v25)
    (connected v25 v21)
    (connected v21 v29)
    (connected v29 v21)
    (connected v21 v30)
    (connected v30 v21)
    (connected v22 v26)
    (connected v26 v22)
    (connected v22 v27)
    (connected v27 v22)
    (connected v22 v28)
    (connected v28 v22)
    (connected v22 v29)
    (connected v29 v22)
    (connected v23 v26)
    (connected v26 v23)
    (connected v24 v25)
    (connected v25 v24)
    (connected v24 v27)
    (connected v27 v24)
    (connected v24 v28)
    (connected v28 v24)
    (connected v25 v27)
    (connected v27 v25)
    (connected v25 v29)
    (connected v29 v25)
    (connected v25 v30)
    (connected v30 v25)
    (connected v26 v29)
    (connected v29 v26)
    
    ; Define the count sequence for tracking path length
        (next n0 n1)
    (next n1 n2)
    (next n2 n3)
    (next n3 n4)
    (next n4 n5)
    (next n5 n6)
    (next n6 n7)
    (next n7 n8)
    (next n8 n9)
    (next n9 n10)
    (next n10 n11)
    (next n11 n12)
    (next n12 n13)
    (next n13 n14)
    (next n14 n15)
    (next n15 n16)
    (next n16 n17)
    (next n17 n18)
    (next n18 n19)
    (next n19 n20)
    (next n20 n21)
    (next n21 n22)
    (next n22 n23)
    (next n23 n24)
    (next n24 n25)
    (next n25 n26)
    (next n26 n27)
    (next n27 n28)
    (next n28 n29)
    (next n29 n30)
    
    ; Initial path length is zero
    (path-length n0)
    
    ; Total number of vertices
    (total-vertices n30)
  )
  
  (:goal
    (and
      ; We've returned to the start vertex
      (back-at-start) 

      ; All vertices have been visited
      (visited v1)
      (visited v2)
      (visited v3)
      (visited v4)
      (visited v5)
      (visited v6)
      (visited v7)
      (visited v8)
      (visited v9)
      (visited v10)
      (visited v11)
      (visited v12)
      (visited v13)
      (visited v14)
      (visited v15)
      (visited v16)
      (visited v17)
      (visited v18)
      (visited v19)
      (visited v20)
      (visited v21)
      (visited v22)
      (visited v23)
      (visited v24)
      (visited v25)
      (visited v26)
      (visited v27)
      (visited v28)
      (visited v29)
      (visited v30)
      
      ; Path length equals total vertices
      (path-length n30)
    )
  )
)

; plan
1. (select-start v30 n0 n1)
   deleted: (path-length n0)
   added: (start v30) (start-selected) (current v30) (visited v30) (path-length n1)
   goals met: 1 of 32
2. (move-to-next v30 v1 n1 n2)
   deleted: (current v30) (path-length n1)
   added: (current v1) (visited v1) (path-length n2)
   goals met: 2 of 32
3. (move-to-next v1 v10 n2 n3)
   deleted: (current v1) (path-length n2)
   added: (current v10) (visited v10) (path-length n3)
   goals met: 3 of 32
4. (move-to-next v10 v6 n3 n4)
   deleted: (current v10) (path-length n3)
   added: (current v6) (visited v6) (path-length n4)
   goals met: 4 of 32
5. (move-to-next v6 v3 n4 n5)
   deleted: (current v6) (path-length n4)
   added: (current v3) (visited v3) (path-length n5)
   goals met: 5 of 32
6. (move-to-next v3 v2 n5 n6)
   deleted: (current v3) (path-length n5)
   added: (current v2) (visited v2) (path-length n6)
   goals met: 6 of 32
7. (move-to-next v2 v4 n6 n7)
   deleted: (current v2) (path-length n6)
   added: (current v4) (visited v4) (path-length n7)
   goals met: 7 of 32
8. (move-to-next v4 v5 n7 n8)
   deleted: (current v4) (path-length n7)
   added: (current v5) (visited v5) (path-length n8)
   goals met: 8 of 32
9. (move-to-next v5 v7 n8 n9)
   deleted: (current v5) (path-length n8)
   added: (current v7) (visited v7) (path-length n9)
   goals met: 9 of 32
10. (move-to-next v7 v8 n9 n10)
   deleted: (current v7) (path-length n9)
   added: (current v8) (visited v8) (path-length n10)
   goals met: 10 of 32
11. (move-to-next v8 v12 n10 n11)
   deleted: (current v8) (path-length n10)
   added: (current v12) (visited v12) (path-length n11)
   goals met: 11 of 32
12. (move-to-next v12 v11 n11 n12)
   deleted: (current v12) (path-length n11)
   added: (current v11) (visited v11) (path-length n12)
   goals met: 12 of 32
13. (move-to-next v11 v17 n12 n13)
   deleted: (current v11) (path-length n12)
   added: (current v17) (visited v17) (path-length n13)
   goals met: 13 of 32
14. (move-to-next v17 v14 n13 n14)
   deleted: (current v17) (path-length n13)
   added: (current v14) (visited v14) (path-length n14)
   goals met: 14 of 32
15. (move-to-next v14 v15 n14 n15)
   deleted: (current v14) (path-length n14)
   added: (current v15) (visited v15) (path-length n15)
   goals met: 15 of 32
16. (move-to-next v15 v16 n15 n16)
   deleted: (current v15) (path-length n15)
   added: (current v16) (visited v16) (path-length n16)
   goals met: 16 of 32
17. (move-to-next v16 v13 n16 n17)
   deleted: (current v16) (path-length n16)
   added: (current v13) (visited v13) (path-length n17)
   goals met: 17 of 32
18. (move-to-next v13 v19 n17 n18)
   deleted: (current v13) (path-length n17)
   added: (current v19) (visited v19) (path-length n18)
   goals met: 18 of 32
19. (move-to-next v19 v9 n18 n19)
   deleted: (current v19) (path-length n18)
   added: (current v9) (visited v9) (path-length n19)
   goals met: 19 of 32
20. (move-to-next v9 v18 n19 n20)
   deleted: (current v9) (path-length n19)
   added: (current v18) (visited v18) (path-length n20)
   goals met: 20 of 32
21. (move-to-next v18 v22 n20 n21)
   deleted: (current v18) (path-length n20)
   added: (current v22) (visited v22) (path-length n21)
   goals met: 21 of 32
22. (move-to-next v22 v28 n21 n22)
   deleted: (current v22) (path-length n21)
   added: (current v28) (visited v28) (path-length n22)
   goals met: 22 of 32
23. (move-to-next v28 v24 n22 n23)
   deleted: (current v28) (path-length n22)
   added: (current v24) (visited v24) (path-length n23)
   goals met: 23 of 32
24. (move-to-next v24 v27 n23 n24)
   deleted: (current v24) (path-length n23)
   added: (current v27) (visited v27) (path-length n24)
   goals met: 24 of 32
25. (move-to-next v27 v25 n24 n25)
   deleted: (current v27) (path-length n24)
   added: (current v25) (visited v25) (path-length n25)
   goals met: 25 of 32
26. (move-to-next v25 v20 n25 n26)
   deleted: (current v25) (path-length n25)
   added: (current v20) (visited v20) (path-length n26)
   goals met: 26 of 32
27. (move-to-next v20 v23 n26 n27)
   deleted: (current v20) (path-length n26)
   added: (current v23) (visited v23) (path-length n27)
   goals met: 27 of 32
28. (move-to-next v23 v26 n27 n28)
   deleted: (current v23) (path-length n27)
   added: (current v26) (visited v26) (path-length n28)
   goals met: 28 of 32
29. (move-to-next v26 v29 n28 n29)
   deleted: (current v26) (path-length n28)
   added: (current v29) (visited v29) (path-length n29)
   goals met: 29 of 32
30. (move-to-next v29 v21 n29 n30)
   deleted: (current v29) (path-length n29)
   added: (current v21) (visited v21) (path-length n30)
   goals met: 31 of 32
31. (complete-cycle v21 v30 n30)
   deleted: (current v21)
   added: (current v30) (back-at-start)
   goals met: 32 of 32
